# WrongConstraintInJoistSystemSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..WrongConstraintInJoistSystemSketch Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Structural Beam System sketch can't be constrained to its beam.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongConstraintInJoistSystemSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongConstraintInJoistSystemSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongConstraintInJoistSystemSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace